Autodesk.Revit.DB.RevisionNumberType
Since:
2015
Determines how a particular revision will be numbered.
Since:
2015

Autodesk.Revit.DB.RevisionNumberType.Alphanumeric
The Revision Number will be a string taken from a user-specified sequence of arbitrary
strings.

Autodesk.Revit.DB.RevisionNumberType.None
No Revision Number will be assigned.

Autodesk.Revit.DB.RevisionNumberType.Numeric
The Revision Number will be a number.